'''
Задание 3_8

    Преобразовать IP-адрес (переменная IP) в двоичный формат и вывести вывод столбцами,
    таким образом:

        первой строкой должны идти десятичные значения байтов
        второй строкой двоичные значения

    Вывод должен быть упорядочен также, как в примере:

        столбцами
        ширина столбца 10 символов

    Пример вывода:

    10        1         1         1
    00001010  00000001  00000001  00000001

    IP = '192.168.3.1'
'''

IP = '192.168.3.1'
DEC_IP = IP.split('.')
BIN_IP = []
for i in DEC_IP:
    print('{0:10}'.format(i), end='')
    BIN_IP.append('0'*(8-len(bin(int(i))[2:]))+bin(int(i))[2:])
print('')
for i in BIN_IP:
    print('{0:10}'.format(i), end='')
print('')
