'''
Задание 6.2

Создать скрипт, который будет обрабатывать конфигурационный файл config_sw1.txt:
	- имя файла передается как аргумент скрипту

Скрипт должен возвращать на стандартный поток вывода команды из переданного 
конфигурационного файла, исключая строки, которые начинаются с '!'.

Между строками не должно быть дополнительного символа перевода строки.
'''

from sys import argv

if len(argv) != 2:
    print('Обработка файла с конфигурацией.')
    print(argv[0][2:] + ' <имя файла конфигурации>')
    exit()

try:
    with open(argv[1], 'r') as f:
        for line in f:
            if line[0] != '!':
                print(line.rstrip())
except FileNotFoundError:
    print('Указанный файл не найден.')
